feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND46 */
#define IFX_CAN_N_NDAT2_ND46_OFF (14u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND47 */
#define IFX_CAN_N_NDAT2_ND47_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND48 */
#define IFX_CAN_N_NDAT2_ND48_OFF (16u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND49 */
#define IFX_CAN_N_NDAT2_ND49_OFF (17u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND50 */
#define IFX_CAN_N_NDAT2_ND50_OFF (18u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND51 */
#define IFX_CAN_N_NDAT2_ND51_OFF (19u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND52 */
#define IFX_CAN_N_NDAT2_ND52_OFF (20u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND53 */
#define IFX_CAN_N_NDAT2_ND53_OFF (21u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND54 */
#define IFX_CAN_N_NDAT2_ND54_OFF (22u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND55 */
#define IFX_CAN_N_NDAT2_ND55_OFF (23u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND56 */
#define IFX_CAN_N_NDAT2_ND56_OFF (24u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND57 */
#define IFX_CAN_N_NDAT2_ND57_OFF (25u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND58 */
#define IFX_CAN_N_NDAT2_ND58_OFF (26u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND59 */
#define IFX_CAN_N_NDAT2_ND59_OFF (27u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_OFF (28u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_OFF (29u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_OFF (30u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_MSK (0x3fu)

