feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_OFF (8u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_OFF (25u)

/** \brief Length for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_OFF (8u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_OFF (25u)

/** \brief Length for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_OFF (4u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_LEN (5u)

