feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP7 */
#define IFX_CAN_N_TX_BRP_TRP7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP8 */
#define IFX_CAN_N_TX_BRP_TRP8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP9 */
#define IFX_CAN_N_TX_BRP_TRP9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP10 */
#define IFX_CAN_N_TX_BRP_TRP10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP11 */
#define IFX_CAN_N_TX_BRP_TRP11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP12 */
#define IFX_CAN_N_TX_BRP_TRP12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP13 */
#define IFX_CAN_N_TX_BRP_TRP13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP14 */
#define IFX_CAN_N_TX_BRP_TRP14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP15 */
#define IFX_CAN_N_TX_BRP_TRP15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP16 */
#define IFX_CAN_N_TX_BRP_TRP16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP17 */
#define IFX_CAN_N_TX_BRP_TRP17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP18 */
#define IFX_CAN_N_TX_BRP_TRP18_OFF (18u)

