feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC37A/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR8 */
#define IFX_CAN_N_TX_BAR_AR8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR9 */
#define IFX_CAN_N_TX_BAR_AR9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR10 */
#define IFX_CAN_N_TX_BAR_AR10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR11 */
#define IFX_CAN_N_TX_BAR_AR11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR12 */
#define IFX_CAN_N_TX_BAR_AR12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR13 */
#define IFX_CAN_N_TX_BAR_AR13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR14 */
#define IFX_CAN_N_TX_BAR_AR14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR15 */
#define IFX_CAN_N_TX_BAR_AR15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR16 */
#define IFX_CAN_N_TX_BAR_AR16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR17 */
#define IFX_CAN_N_TX_BAR_AR17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR18 */
#define IFX_CAN_N_TX_BAR_AR18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR19 */
#define IFX_CAN_N_TX_BAR_AR19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR20 */
#define IFX_CAN_N_TX_BAR_AR20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR21 */
#define IFX_CAN_N_TX_BAR_AR21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR22 */
#define IFX_CAN_N_TX_BAR_AR22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR23 */
#define IFX_CAN_N_TX_BAR_AR23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR24 */
#define IFX_CAN_N_TX_BAR_AR24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR25 */
#define IFX_CAN_N_TX_BAR_AR25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR26 */
#define IFX_CAN_N_TX_BAR_AR26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR27 */
#define IFX_CAN_N_TX_BAR_AR27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR28 */
#define IFX_CAN_N_TX_BAR_AR28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR29 */
#define IFX_CAN_N_TX_BAR_AR29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_MSK (0x1u)

